import { BlockMap } from "@source/data/index";

// 左上角坐标值小, 右下角坐标值大

// prettier-ignore
export const BLOCK_DEFS: Record<
  string,
  Partial<{
    min: Array2<number>; // 当前cad最小坐标
    max: Array2<number>; // 当前cad最大坐标
    offset: Array2<number>, // 偏移量
  }>
> = {
  "B01": { min: [567247.19, -2397452.49], max: [567284.16, -2397005.65], },

  "B02": { min: [567190.27, -2397542.53], max: [567227.19, -2397005.53], },
  "B03": { min: [567134.66, -2397542.50], max: [567171.74, -2397005.56], },
  
  "B04": { min: [567077.77, -2397542.53], max: [567114.69, -2397005.53] },
  "B05": { min: [567022.16, -2397542.50], max: [567059.24, -2397005.56] },

  "B06": { min: [566965.27, -2397542.53], max: [567002.19, -2397005.53] },
  "B07": { min: [566909.66, -2397542.50], max: [566946.74, -2397005.56] },

  "B08": { min: [566852.77, -2397542.53], max: [566889.69, -2397005.53] },
  "B09": { min: [566797.16, -2397542.50], max: [566834.24, -2397005.56] },

  "B10": { min: [566740.27, -2397542.53], max: [566777.19, -2397005.53] },
  "B11": { min: [566684.66, -2397542.50], max: [566721.74, -2397005.56] },

  "B12": { min: [566627.77, -2397542.53], max: [566664.69, -2397005.53] },
  "B13": { min: [566572.16, -2397542.50], max: [566609.24, -2397005.56] },

  "B14": { min: [566515.27, -2397542.53], max: [566552.19, -2397005.53] },
  "B15": { min: [566459.66, -2397542.50], max: [566496.74, -2397005.56] },

  "B16": { min: [566402.77, -2397542.53], max: [566439.69, -2397005.53] },
  "B17": { min: [566347.16, -2397542.50], max: [566384.24, -2397005.56] },

  "B18": { min: [566290.27, -2397542.53], max: [566327.19, -2397005.53] },
  "B19": { min: [566234.66, -2397542.50], max: [566271.74, -2397005.56] },

  "B20": { min: [566177.77, -2397542.53], max: [566214.69, -2397005.53] },
  "B21": { min: [566122.16, -2397542.50], max: [566159.24, -2397005.56] },
};

// 补全自定义对象
const keys = Object.keys(BLOCK_DEFS);
for (let i = 0; i < keys.length; i++) {
  const key = keys[i];
  const no = key.slice(1);
  const offset = [0.0, 0.0];
  if (Number.parseInt(no) % 2 !== 0) offset[0] = 5;
  BLOCK_DEFS[key] = Object.assign({ offset }, BLOCK_DEFS[key]); // prettier-ignore
}

export const handleYardData = async () => {
  BlockMap.clear();

  for (const key of Object.keys(BLOCK_DEFS)) {
    const blockDef = BLOCK_DEFS[key];
    BlockMap.set(key, { defs: blockDef });
  }
};
